Autodesk.Revit.DB.PlanViewRange.SetOffset(Autodesk.Revit.DB.PlanViewPlane,System.Double)
Set the offset value associated with a View Depth plane
planViewPlane:
View Depth plane
offset:
Offset value
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PlanViewRange.GetOffset(Autodesk.Revit.DB.PlanViewPlane)
Get the offset value associated with a View Depth plane
planViewPlane:
View Depth plane
Returns:
Offset value
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PlanViewRange.SetLevelId(Autodesk.Revit.DB.PlanViewPlane,Autodesk.Revit.DB.ElementId)
Set the level for a  View Depth plane
planViewPlane:
The View Depth plane
id:
Id of the level
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PlanViewRange.GetLevelId(Autodesk.Revit.DB.PlanViewPlane)
Get the element id of the level for a View Depth plane
planViewPlane:
The plane whose level will be returned
Returns:
Id of the level
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.PlanViewRange.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.PlanViewRange.Current
View range for the current plane
Since:
2013

Autodesk.Revit.DB.PlanViewRange.LevelBelow
View range for the level below the specified plane
Since:
2013

Autodesk.Revit.DB.PlanViewRange.LevelAbove
View range for the level above the specified plane
Since:
2013

Autodesk.Revit.DB.PlanViewRange.Unlimited
View range is unlimited
Since:
2013

Autodesk.Revit.DB.PlanViewRange
This class represents the view range of a plan view or a plan region.
It records the element ids of the levels which a plane is relative to
and the offset of each plane from that level.
Since:
2013